# keywords.py

DETAILS_KEYWORDS = {
    "ru": [
        "завтра", "сегодня", "терминово", "срочно", "большой чемодан", "с багажом",
        "с ребенком", "вечером", "утром", "днем", "с животным", "с собакой",
        "прямо сейчас", "кондиционер", "встреча с табличкой", "некурящий водитель",
        "Загрузка салона", "Животное", "Кондиционер", "Встреча с табличкой",
        "Курьер. доставка", "Терминал", "Чек", "Детское кресло", "Драйвер",
        "Англоязычный водитель", "Трос", "Подвоз топлива", "Провод", "Я буду курить",
        "послезавтра", "через 3 дня", "на 11 октября", "17 часов 30 минут", "о 17:30",
        "через 4 дня", "на 15 октября", "в 14 часов 45 минут", "послезавтра о 10:00"
    ],
    "uk": [
        "завтра", "сьогодні", "терміново", "велика валіза", "з багажем",
        "з дитиною", "ввечері", "вранці", "вдень", "з твариною", "з собакою",
        "зараз", "кондиціонер", "зустріч з табличкою", "некурящий водій",
        "Загрузка салона", "Животное", "Кондиционер", "Встреча с табличкой",
        "Курьер. доставка", "Терминал", "Чек", "Детское кресло", "Драйвер",
        "Англоязычный водитель", "Трос", "Подвоз топлива", "Провод", "Я буду курить",
        "післязавтра", "через 3 дні", "на 11 жовтня", "17 годин 30 хвилин", "о 17:30",
        "через 4 дні", "на 15 жовтня", "в 14 годин 45 хвилин", "післязавтра о 10:00"
    ],
    "en": [
        "tomorrow", "today", "urgently", "large suitcase", "with luggage",
        "with child", "evening", "morning", "afternoon", "with pet", "with dog",
        "right now", "conditioner", "meet with the sign", "non-smoking driver",
        "Carbon loading", "Animal", "Conditioner", "Meet with the sign",
        "Courier. delivery", "Terminal", "Check", "Baby seat", "Driver",
        "Non-smoking driver", "English speaking driver", "Cable", "Fuel delivery",
        "Wire", "I will smoke",
        "day after tomorrow", "in 3 days", "on October 11", "17 hours 30 minutes", "at 17:30",
        "in 4 days", "on October 15", "at 14 hours 45 minutes", "day after tomorrow at 10:00"
    ]
}
