# keywords.py

DETAILS_KEYWORDS = {
    "ru": [
        "завтра", "сегодня", "терминово", "срочно", "большой чемодан", "с багажом",
        "с ребенком", "вечером", "утром", "днем", "с животным", "с собакой",
        "прямо сейчас", "кондиционер", "встреча с табличкой", "некурящий водитель",
        "Загрузка салона", "Животное", "Кондиционер", "Встреча с табличкой",
        "Курьер. доставка", "Терминал", "Чек", "Детское кресло", "Драйвер",
        "Англоязычный водитель", "Трос", "Подвоз топлива", "Провод", "Я буду курить"
    ],
    "uk": [
        "завтра", "сьогодні", "терміново", "велика валіза", "з багажем",
        "з дитиною", "ввечері", "вранці", "вдень", "з твариною", "з собакою",
        "зараз", "кондиціонер", "зустріч з табличкою", "некурящий водій",
        "Загрузка салона", "Животное", "Кондиционер", "Встреча с табличкой",
        "Курьер. доставка", "Терминал", "Чек", "Детское кресло", "Драйвер",
        "Англоязычный водитель", "Трос", "Подвоз топлива", "Провод", "Я буду курить"
    ],
    "en": [
        "tomorrow", "today", "urgently", "large suitcase", "with luggage",
        "with child", "evening", "morning", "afternoon", "with pet", "with dog",
        "right now", "conditioner", "meet with the sign", "non-smoking driver",
        "Carbon loading", "Animal", "Conditioner", "Meet with the sign",
        "Courier. delivery", "Terminal", "Check", "Baby seat", "Driver",
        "Non-smoking driver", "English speaking driver", "Cable", "Fuel delivery",
        "Wire", "I will smoke"
    ]
}
