@extends('layouts.taxiNewCombo')

@section('content')

    <div class="container-fluid">
        <div class="row">
            @include ('layouts.services')

            <div class="col-lg-9 col-sm-6 col-md-9" >

                <div class="container-fluid">
                    <a href="{{route('homeCombo')}}"
                       style="text-decoration: none">
                        <h4 class="text-center text-primary gradient"> <b>Пропонуємо Вам найсучасніший
                                сервіс організації поїздок на комфортабельних авто за доступними цінами.</b></h4>
                    </a>

                </div>
                <div class="container-fluid">
                    <div class="row">
                        <ul class="olderOne">
                            <div class="container-fluid">
                                <div class="row">
                                    <li class="col-lg-6 col-sm-12">
                                        <a href="{{route('orderReklama')}}">
                                            <h5 class="text-center"><b>Попереднє замовлення</b></h5>
                                            <small style="text-align: left">
                                                Можливість оформити замовлення таксі на бажаний час та день.
                                                Зручно при поїздках до аеропортів та вокзалів Києва. Швидко, надійно та недорого.
                                                Розрахуйте точну вартість на сайті.
                                            </small>
                                        </a>
                                    </li>

                                    <li class="col-lg-6 col-sm-12">
                                        <a href="{{route('driverReklama')}}">
                                            <h5 class="text-center"><b>Послуга "тверезий водій"</b></h5>
                                            <small style="text-align: left">
                                                Професійний водій нашої служби акуратно та швидко пережене за вказаною адресою
                                                або на найближче паркування Ваш автомобіль. Замовити на сайті
                                            </small>
                                        </a>
                                    </li>
                                </div>
                            </div>
                            <div class="container-fluid">
                                <div class="row">
                                    <li class="col-lg-6 col-sm-12">
                                        <a href="{{route('stationReklama')}}">
                                            <h5 class="text-center"><b>Таксі на вокзал</b></h5>
                                            <small style="text-align: left">
                                                Можливість оформити замовлення таксі на бажаний час та день при поїздках до
                                                вокзалів Києва  та області. Швидко, надійно та недорого. Розрахуйте точну вартість на сайті.
                                            </small>
                                        </a>
                                    </li>

                                    <li class="col-lg-6 col-sm-12">
                                        <a href="{{route('airportReklama')}}">
                                            <h5 class="text-center"><b>Таксі в аеропорти Бориспіль та Жуляни</b></h5>
                                            <small style="text-align: left">
                                                Оцініть  найвигідніші ціни та якісний сервіс на поїздку в аеропорти міста Києва.
                                                Розрахуйте вартість онлайн.
                                            </small>
                                        </a>
                                    </li>
                                </div>
                            </div>
                            <div class="container-fluid">
                                <div class="row">
                                    <li class="col-lg-6 col-sm-12">
                                        <a href="{{route('regionReklama')}}">
                                            <h5 class="text-center"><b>Дешеве обласне міжміське таксі</b></h5>
                                            <small style="text-align: left">
                                                Великий парк комфортабельних автомобілів для міжміських поїздок.
                                                Дізнайтесь на сайті.
                                            </small>
                                        </a>
                                    </li>

                                    <li class="col-lg-6 col-sm-12">
                                        <a href="{{route('tableReklama')}}">
                                            <h5 class="text-center"><b>Зустріч водієм таксі з табличкою</b></h5>
                                            <small style="text-align: left">
                                                Водій зустріне вас з табличкою біля виходу з паспортного контролю
                                                або біля виходу з вагона на вокзалі.
                                            </small>
                                        </a>
                                    </li>
                                </div>
                            </div>
                        </ul>

                    </div>

                </div>

                <div class="container" style="background-color: hsl(0, 0%, 96%)">
                    <br>
                    <div class="container" style="text-align: center">
                        <h1 class="gradient"><b>Політика конфіденційності</b></h1>
                    </div>
                    <div class="container">
                        <div class="row gx-lg-5 align-items-center">
                            <div class="text-center">


                                <p class="lead" style="text-align: justify">
                                    Це Положення про обробку та захист персональних даних (надалі – «Положення») розроблене Служба Таксі Лайт Юа  (надалі за текстом – «Ми» у відповідних відмінках), яке є володільцем персональних даних у розумінні Закону України «Про захист персональних даних» від 01 червня 2010 року № 2297-VI (надалі – «Закон») та регулюється цим Законом.
                                </p>

                                <p class="lead" style="text-align: justify">
                                    Одним із Наших пріоритетів є послідовний та ефективний захист Ваших персональних даних, тому Ми докладаємо максимум зусиль, щоб Ваші персональні дані були у безпеці.
                                </p>

                                <p class="lead" style="text-align: justify">
                                    Цим Положенням Ми б хотіли поінформувати Вас про те, які саме персональні дані та в який спосіб Ми обробляємо, а також цілі та засоби обробки та захисту персональних даних. Це Положення поширюється на всі види персональних даних користувачів онлайн сервісу Служба Таксі Лайт Юа, які Ми збираємо та обробляємо через веб-сайт: https://m.easy-order-taxi.site (надалі – «Веб-сайт»), додатки для мобільних пристроїв  Android (надалі – «Мобільні додатки»), а також через інші джерела, зазначені нижче в цьому Положенні. Використовуючи та реєструючись на Веб-сайті та/або в Мобільних додатках, а також при здійсненні замовлення без реєстрації через Веб-сайт, Ви підтверджуєте, гарантуєте та заявляєте про те, що Ви прочитали та зрозуміли це Положення і надаєте однозначну згоду на обробку Нами Ваших персональних даних у відповідності до цього Положення. Якщо Ви не погоджуєтеся з цим Положенням у повному обсязі, не використовуйте Веб-сайт та/або Мобільні додатки.
                                </p>

                                <p class="lead" style="text-align: justify">
                                    Які персональні дані Ми обробляємо?
                                    Персональні дані, які Ви надаєте Нам
                                    А) Користувачі онлайн сервісу Служба Таксі Лайт Юа .
                                    Ми обробляємо персональні дані, які Ви надаєте Нам, а саме: ім’я, електронну адресу, номер телефону, місто, як при заповненні реєстраційної форми на Веб-сайті чи у Мобільному додатку, так і при заповненні свого профілю. Ми також можемо обробляти Ваші персональні дані, коли Ви реєструєтесь через Facebook, Google plus.
                                    Ми обробляємо Ваші персональні дані, а саме: номер телефону та ім’я користувача при здійсненні Вами замовлення через Веб-сайт без реєстрації.
                                    Ми також обробляємо Ваші персональні дані у випадках, коли Вам необхідно зв’язатися з Нашою службою підтримки клієнтів або звернутися до Нас через інші канали (наприклад, через соціальні мережі).
                                    Існують й інші випадки, коли Ви надаєте Нам персональні дані. Ви можете створити обліковий запис (акаунт), який дозволяє зберігати персональні налаштування, переглядати попередні замовлення, планувати майбутні замовлення і керувати поточними.
                                    Беручи участь у рекламних акціях чи розіграшах – Ви також будете надавати Нам свої персональні дані. Окрім того, Ви можете надсилати Нам відгуки про Веб-сайт та Мобільний додаток, ділитися своєю думкою або звертатися за допомогою щодо користування Веб-сайтом чи Мобільним додатком.
                                    У разі здійснення страхування Вашого життя та здоров’я під час перевезення та з метою отримання страхового відшкодування, Ви передаєте Нам свої персональні дані: прізвище, ім’я та по-батькові, номер телефону, дату народження, серію та номер паспорту, реєстраційний номер облікової картки платника податків та інші відомості, які можуть вимагатися страховою компанією.
                                    У разі здійснення страхування відправлень, якщо Ви замовили послугу доставки, Ви передаєте Нам свої персональні дані: адресу, прізвище, ім’я та по-батькові, номер телефону.
                                    Б) Партнери Служба Таксі Лайт Юа
                                    Ми обробляємо персональні дані, які Ви надаєте Нам: ім’я, прізвище, електронну адресу, номер телефону, дані свідоцтва про реєстрацію транспортного засобу, дані посвідчення водія, реєстраційний номер облікової картки платника податків (ІПН), дані договору обов’язкового страхування цивільно-правової відповідальності (ОСЦПВ), Ваше фото (зображення), місто при укладенні з Нами Договору про надання доступу до онлайн-сервісу (постачання програмної продукції) шляхом акцепту Публічної оферти, розміщеної на Веб-сайті, іншу інформацію, яку Ви Нам добровільно надаєте.
                                    Ми обробляємо Ваші персональні дані також у випадках, коли Вам необхідно зв’язатися з Нашою службою підтримки партнерів або звернутися до Нас через інші канали.
                                    Існують й інші випадки, коли Ви надаєте Нам персональні дані. Ви можете створити обліковий запис (особистий кабінет), який дозволяє зберігати персональні налаштування, завантажувати фотографії, переглядати виконані замовлення тощо.
                                    Беручи участь у рекламних акціях чи розіграшах – Ви також будете надавати Нам персональні дані. Окрім того, Ви можете надсилати Нам відгуки про Веб-сайт та Мобільний додаток, ділитися своєю думкою або звертатися за допомогою щодо користування Веб-сайтом або Мобільним додатком.
                                    У разі здійснення страхування Вашого життя та здоров’я під час перевезення пасажирів та з метою отримання страхового відшкодування, Ви передаєте Нам свої персональні дані: прізвище, ім’я та по-батькові, номер телефону, дату народження, серію та номер паспорту, реєстраційний номер облікової картки платника податків та інші відомості, які можуть вимагатися страховою компанією.
                                    Для посилення заходів безпеки користувачів онлайн сервісу Служба Таксі Лайт Юа  та належної додаткової перевірки/ідентифікації особи Партнера Служба Таксі Лайт, Ми можемо також обробляти наступні персональні дані Партнерів Служба Таксі Лайт, а саме: дані документів, що засвідчують особу (наприклад, номер та серію паспорта, строк його дії, дату видачі та назву органу, який його видав; дані посвідки на проживання) та/або їх копії, іншу інформацію, яку Нам добровільно надають Партнери Служба Таксі Лайт Юа.
                                    Дані, які Ми обробляємо автоматично
                                    Ми можемо автоматично обробляти певні дані, серед яких Ваша IP-адреса, дата і час, коли Ви користувалися Нашими послугами, інформація про апаратне і програмне забезпечення, а також інтернет-браузер, який Ви використовуєте, а крім того, інформація про операційну систему Вашого комп’ютера чи мобільного пристрою (наприклад, версії додатків та налаштування мови). Ми можемо також збирати інформацію про натискання і сторінки, які Ми Вам показували.
                                    Якщо Ви використовуєте мобільний пристрій, Ми також можемо отримувати дані, що ідентифікують цей пристрій, його налаштування і характеристики, дані місця розташування, збої в роботі програми, інші системні операції та Ваші рекламні ідентифікатори. Коли Ви здійснюєте замовлення через Веб-сайт або Мобільний додаток, Наша система фіксує за допомогою яких засобів і через які веб-сайти воно було здійснене або з яких веб-сайтів Ви перейшли на Веб-сайт або до Мобільних додатків.
                                    Мобільні додатки можуть отримувати доступ до різноманітних служб та даних Вашого мобільного пристрою, зокрема, але не обмежуючись: до телефонної книги (контакти), місцезнаходження та зовнішніх пристроїв зберігання даних (карти пам’яті). У будь-якому випадку, доступ до служб Вашого мобільного пристрою можливий лише у випадку надання Вашої окремої однозначної згоди у відповідь на Наше push-повідомлення.
                                    Вищезазначені типи інформації не завжди можуть містити персональні дані (тобто дані, які ідентифікують або можуть ідентифікувати Вас). Частина цієї інформації може натомість становити неперсональні дані (тобто дані, які не ідентифікують і не можуть ідентифікувати Вас).
                                    Персональні дані інших осіб, які Ви надаєте Нам
                                    Користувачі онлайн сервісу Служба Таксі Лайт Юа .
                                    Звичайно, Ви можете робити замовлення не тільки для себе. Ви можете замовити послугу перевезення для будь-якої особи, надавши Нам її номер телефону та ім’я. Крім того, при замовленні послуги доставки Ви передаєте Нам персональні дані одержувача відправлень: адресу, прізвище, ім’я та номер телефону. Однак, з цього приводу Ми повинні зазначити, що Ви відповідальні за те, щоб особа, персональні дані якої Ви надали, знала, що Ви це зробили, зрозуміла та погодилася з тим, яким чином Ми використовуємо її персональні дані (як це зазначено в цьому Положенні).
                                    Для цього Ви зобов’язані заздалегідь поділитися посиланням на це Положення, доступне на Веб-сайті, із такою особою, і цим Ви підтверджуєте, що Ви зробили це, отримали однозначну згоду такої особи на обробку її персональних даних відповідно до умов, викладених у цьому Положенні, і надасте таку згоду Нам за запитом.
                                    Інформація, отримана з інших джерел
                                    Ця інформація може включати відгуки користувачів, такі як оцінки або компліменти, інформацію користувачів чи інших осіб, які надають інформацію у зв’язку з претензіями чи суперечками, інформацію від страхових постачальників, постачальників фінансових послуг та інформацію з загальнодоступних джерел. Ми можемо об’єднати інформацію, зібрану з цих джерел, з іншою інформацією, що є у Нашому розпорядженні.
                                    Для чого Ми обробляємо Ваші персональні дані?
                                    Ми обробляємо наступні персональні дані для таких цілей. Зокрема, Ваші персональні дані можуть бути використані таким чином:
                                    А) Користувачі онлайн сервісу Служба Таксі Лайт Юа .
                                    – Розміщення замовлень: Ми використовуємо Ваші персональні дані з метою розміщення Вами замовлень на перевезення пасажирів та/або доставку в онлайн сервісі Служба Таксі Лайт Юа  та для передачі Ваших персональних даних Партнерам з метою виконання Партнерами відповідних замовлень. Передати Ваші персональні дані Партнерам в інших випадках Ми можемо лише в разі отримання Вашої окремої згоди.
                                    – Служба підтримки клієнтів: Ми забезпечуємо цілодобову підтримку клієнтів. Володіючи Вашими персональними даними, команда служби підтримки може допомогти Вам із замовленнями та відповісти на пов’язані з ними запитання, а також будь-які інші запитання.
                                    – Обліковий запис (акаунт): користувачі можуть створити акаунт на Веб-сайті або в Мобільному додатку. Ми використовуємо інформацію, яку Ви Нам надаєте, щоб керувати акаунтом.
                                    – Маркетинг: Ми також використовуємо Ваші персональні дані (номер телефону та адресу електронної пошти) для відправлення (розсилки) інформації, листів з новинами, рекламних та промо матеріалів. Беручи участь в рекламних акціях, відповідна інформація буде використана для керування цими акціями. Ми також розміщуємо інформацію, листи з новинами, рекламні та промо матеріали в Мобільному додатку та на Веб-сайті.
                                    Ви маєте право відмовитися від отримання (розсилки) інформації, листів з новинами, рекламних та промо- матеріалів, відправивши відповідне повідомлення на електронну адресу: taxi.easy.ua.sup@gmail.com
                                    – Спілкування з Вами: Ми можемо звертатися до Вас і з інших питань електронною поштою, по телефону та через електронні повідомлення, в залежності від типу контактної інформації, якою Ви з Нами поділилися. Ми також докладаємо всіх зусиль для опрацювання всіх запитів, які Ви Нам відправляєте.
                                    – Відстеження дзвінків: коли Ви телефонуєте в службу підтримки, Ми використовуємо автоматичну систему визначення номеру, щоб ідентифікувати Ваш номер телефону з Вашим замовленням – це допоможе і Вам, і Нам зекономити час. Розмови з працівниками служби підтримки можуть прослуховуватися в режимі реального часу або записуватися з метою контролю якості надання послуг та подальшого навчання Нашої команди. Записи зберігаються протягом обмеженого періоду часу відповідно до мети їх обробки і видаляються автоматично, крім випадків, коли Ми вважатимемо за потрібне зберегти їх на більш тривалий період (за умови необхідності, в тому числі з метою розслідування випадків, що пов’язані з порушенням законодавства). Всі записи телефонних розмов будуть використовуватися відповідно до цього Положення. Цим Ви надаєте однозначну згоду на прослуховування та запис телефонних розмов та обробку Нами відповідних персональних даних.
                                    – Використання служб Вашого мобільного пристрою: Мобільний додаток може отримувати доступ до різноманітних служб та даних Вашого мобільного пристрою, зокрема, але не обмежуючись до телефонної книги (контакти), місцезнаходження та зовнішніх пристроїв зберігання даних (карти пам’яті). Доступ до служб Вашого мобільного пристрою можливий лише у випадку надання Вашої окремої однозначної згоди у відповідь на Наше push-повідомлення.
                                    • Розділ «Телефонна книга (контакти)»: доступ до цього розділу потрібен, щоб Ви могли зробити замовлення для будь-якої іншої особи шляхом надання Нам її номеру телефону з Вашої телефонної книги. Ми не передаємо дані телефонної книги третім особам, окрім передачі Партнеру номеру телефона особи, перевезення для якої замовлено, з метою виконання замовлення для цієї особи, та не використовуємо їх іншим чином, ніж у зв’язку з використанням Мобільного додатку як передбачено цим Положенням.
                                    • Розділ «Місцезнаходження»: Ми отримуємо доступ до Вашого місцезнаходження з метою забезпечення якості надання послуг, зокрема демонстрації місцезнаходження автомобіля, який буде виконувати Ваше замовлення. Ми не передаємо ці дані третім особам, за винятком випадків, коли під час поїздки існує імовірність загрози Вашому життю чи здоров’ю та лише після того, як Ви натиснули кнопку SOS у Мобільному додатку Служба Таксі Лайт Юа .
                                    • Розділ «Запис на карту пам’яті»: Ми можемо записувати на карту пам’яті Вашого телефону деякі технічні тимчасові дані (кеш), пов’язані з Вашим замовленням. Ми не передаємо ці дані третім особам та не використовуємо їх іншим чином, ніж для забезпечення безперебійного функціонування Мобільного додатку.
                                    – У разі здійснення страхування Вашого життя та здоров’я під час перевезення: Ми передаємо отримані від Вас персональні дані страховій компанії з метою страхування Вашого життя та здоров’я під час перевезення, в тому числі для передачі персональних даних іноземним суб’єктам відносин, пов’язаних із персональними даними, з метою виконання вимог законодавства, договору страхування життя та здоров’я, інших договорів, в тому числі перестрахування, реалізації прав, наданих страховій компанії законодавством або договором, та забезпечення реалізації податкових відносин та відносин у сферах бухгалтерського обліку, аудиту, фінансових послуг та послуг асистансу, реклами, маркетингових та актуарних досліджень, оцінки якості сервісу страхової компанії. У випадку здійснення страхування відправлень, Ми також передаємо Ваші персональні дані страховій компанії, яка здійснює страхування відправлень, в разі настання страхового випадку в результаті замовлення Вами послуги доставки (якщо застосовне). У випадку передачі Ваших персональних даних іноземним суб’єктам відносин, пов’язаних із персональними даними, якщо це необхідно для викладених вище цілей, цим Ви надаєте свою однозначну згоду на передачу (а також подальшу обробку) Ваших персональних даних за межі України, включно до юрисдикцій, які не визнані такими, що забезпечують належний захист даних.
                                    – Захист Вашого життя та здоров’я під час перевезення: Ми можемо передавати Ваші персональні дані (ім’я, прізвище, номер телефону, маршрут поїздки та місцезнаходження) екстреним службам з метою порятунку Вашого життя чи здоров’я та/або запобігання загрозі заподіяння шкоди Вашому життю чи здоров’ю під час поїздки, якщо Ви натиснули кнопку SOS у Мобільному додатку Служба Таксі Лайт Юа .
                                    – Юридичні цілі: Ми можемо використовувати Ваші персональні дані для обробки та передачі їх компетентним органам виключно у випадках, передбачених чинним законодавством України.
                                    – Маркетингові активності та інші заходи рекламного характеру: Ми можемо передавати Ваші персональні дані (прізвище, ім’я, номер телефону) третім особам з метою пропонування/надання вказаними третіми особами Вам знижок (дисконтів) від існуючих (поточних) цін на товари та/або послуги таких третіх осіб, та/або подарунків, та/або призів, та/або інших заохочень, які пропонуються та надаються такими третіми особами.
                                    Б) Партнери Служба Таксі Лайт Юа
                                    – Виконання замовлень: Ми обробляємо Ваші персональні дані, якщо Ви прийняли до виконання замовлення на перевезення та/або доставку, для передачі їх користувачу онлайн сервісу Служба Таксі Лайт Юа
                                    – Служба підтримки Партнерів: Ми забезпечуємо підтримку Партнерів. Володіючи Вашими персональними даними, команда служби підтримки може допомогти Вам із замовленнями та відповісти на пов’язані з ними запитання, а також будь-які інші запитання.
                                    – Обліковий запис (особистий кабінет): Партнери можуть створити особистий кабінет на Веб-сайті. Ми використовуємо інформацію, яку Ви Нам надаєте, щоб керувати особистим кабінетом. Ми надійно зберігаємо та не передаємо третім особам дані, пов’язані з налаштуваннями та статистичною інформацією, що міститься у Мобільному додатку (налаштування фільтрів та алгоритмів вибору замовлень, статистику виконаних замовлень тощо).
                                    – Маркетинг: Ми також використовуємо Ваші персональні дані для відправлення (розсилки) інформації, листів з новинами та рекламних матеріалів. Беручи участь в рекламних акціях, відповідна інформація буде використана для керування цими акціями.
                                    Ви маєте право відмовитися від отримання (розсилки) інформації, листів з новинами, рекламних та промо- матеріалів, відправивши відповідне повідомлення на електронну адресу: taxi.easy.ua.sup@gmail.com.
                                    – Спілкування з Вами: Ми можемо звертатися до Вас і з інших питань електронною поштою, телефоном та через електронні повідомлення, в залежності від типу контактної інформації, якою Ви з Нами поділилися. Ми також докладаємо всіх зусиль для опрацювання всіх запитів, які Ви Нам відправляєте.
                                    – Відстеження дзвінків: коли Ви телефонуєте в службу підтримки Партнерів, Ми використовуємо автоматичну систему визначення номера, щоб ідентифікувати Ваш телефонний номер з Вашим замовленням – це допоможе і Вам, і Нам зекономити час. Розмови з працівниками служби підтримки можуть прослуховуватися в режимі реального часу або записуватися з метою контролю якості послуг і подальшого навчання Нашої команди. Записи зберігаються протягом обмеженого періоду часу і видаляються автоматично, крім випадків, коли Ми вважатимемо за потрібне зберегти їх на більш тривалий період (за умови необхідності, в тому числі з метою розслідування випадків, що пов’язані з порушенням законодавства). Всі записи телефонних розмов будуть використовуватися відповідно до цього Положення. Цим Ви надаєте однозначну згоду на прослуховування та запис телефонних розмов та обробку Нами відповідних персональних даних.
                                    – Використання служб Вашого мобільного пристрою: Мобільні додатки можуть отримувати доступ до різноманітних служб та даних Вашого мобільного пристрою, зокрема, але не обмежуючись: місцезнаходження та зовнішніх пристроїв зберігання даних (карти пам’яті). Доступ до служб Вашого мобільного пристрою можливий лише у випадку надання Вашої окремої однозначної згоди у відповідь на Наше push-повідомлення.
                                    • Розділ «Місцезнаходження»: Ми отримуємо доступ до Вашого місцезнаходження з метою забезпечення якості надання послуг, зокрема забезпечення актуальної інформації про замовлення, які розміщені поблизу до Вашого місцезнаходження, а також забезпечення безпеки, запобігання та виявлення випадків шахрайства. Дані стосовно Вашого місцезнаходження обробляються, коли Мобільний додаток  працює у пріоритетному (відкрито та відображається на екрані) або фоновому (відкрито, але не відображається на екрані) режимі. Для того, аби припинити обробку даних Вашого місцезнаходження, Ви повинні закрити додаток . В будь-якому випадку Ми не передаємо дані стосовно Вашого місцезнаходження третім особам.
                                    • Розділ «Запис на карту пам’яті»: Ми можемо записувати на карту пам’яті Вашого телефону деякі технічні тимчасові дані (кеш), пов’язані з використанням Вами Мобільного додатку. Ми не передаємо ці дані третім особам та не використовуємо їх іншим чином, ніж для забезпечення безперебійного функціонування Мобільного додатку.
                                    – У разі здійснення страхування Вашого життя та здоров’я під час перевезення пасажирів: Ми передаємо отримані від Вас персональні дані страховій компанії з метою страхування Вашого життя та здоров’я під час перевезення, в тому числі для передачі персональних даних іноземним суб’єктам відносин, пов’язаних із персональними даними, з метою виконання вимог законодавства, договору страхування життя та здоров’я, інших договорів, в тому числі перестрахування, реалізації прав, наданих страховій компанії законодавством або договором та забезпечення реалізації податкових відносин та відносин у сферах бухгалтерського обліку, аудиту, фінансових послуг та послуг асистансу, реклами, маркетингових та актуарних досліджень, оцінки якості сервісу страхової компанії. У випадку здійснення страхування відправлень Ми також передаємо Ваш номер телефону страховій компанії, в разі настання страхового випадку в результаті виконання Вами послуги доставки. У випадку передачі Ваших персональних даних іноземним суб’єктам відносин, пов’язаних із персональними даними, якщо це необхідно для викладених вище цілей, цим Ви надаєте свою однозначну згоду на передачу (а також подальшу обробку) Ваших персональних даних за межі України, включно до юрисдикцій, які не визнані такими, що забезпечують належний захист даних.
                                    – Пошук залишених у автомобілі речей: Ми передаємо Ваше ім’я та номер телефону користувачам онлайн сервісу Служба Таксі Лайт Юа  з метою сприяння у поверненні їм особистих речей, залишених в автомобілі під час перевезення.
                                    Ми можемо передати номер Вашого телефону користувачам онлайн сервісу Служба Таксі Лайт Юа  в інших випадках лише в разі отримання Вашої окремої згоди.
                                    – Бухгалтерські цілі: Ми використовуємо Ваше прізвище, ім’я з метою ведення бухгалтерського та податкового обліку наданих Вам послуг.
                                    – Юридичні цілі: Ми можемо використовувати Ваші персональні дані для обробки та передачі їх компетентним органам виключно у випадках, передбачених чинним законодавством України.
                                    – Маркетингові активності та інші заходи рекламного характеру: Ми можемо передавати Ваші персональні дані (прізвище, ім’я, номер телефону) третім особам з метою пропонування/надання вказаними третіми особами Вам знижок (дисконтів) від існуючих (поточних) цін на товари та/або послуги таких третіх осіб, та/або подарунків, та/або призів, та/або інших заохочень, які пропонуються та надаються такими третіми особами.
                                    В який спосіб Ми передаємо Ваші персональні дані третім особам?
                                    За певних обставин Ми можемо передавати Ваші персональні дані третім особам.
                                    Жодна передача Ваших персональних даних, яка здійснюється на підставі Вашої згоди на обробку персональних даних у відповідності до цього Положення, не потребуватиме Вашої окремої згоди або надання Вам окремого повідомлення.
                                    А) Користувачі онлайн сервісу Служба Таксі Лайт Юа
                                    – Розміщення замовлень: Ми передаємо Ваші персональні дані Партнерам з метою виконання Партнерами Ваших замовлень. В інших випадках на письмовий чи усний запит Партнера Ми можемо передати номер Вашого телефону Партнеру лише в разі отримання Вашої окремої згоди.
                                    – Треті особи, що постачають послуги: Ми можемо використовувати послуги третіх осіб для обробки Ваших персональних даних від Нашого імені, які вважатимуться розпорядниками персональних даних у розумінні Закону. Ця обробка відбувається з різними, проте завжди законними цілями, наприклад, для розсилки інформації та рекламних матеріалів від Нашого імені і в Наших інтересах. Незалежні постачальники послуг погоджуються з обов’язковим дотриманням конфіденційності і не мають права використовувати Ваші персональні дані для інших цілей. Ми не передаємо Ваші персональні дані третім особам для розсилки інформації та рекламних матеріалів від імені і в інтересах інших осіб, ніж Ми.
                                    – Компетентні органи державної влади: Ми передаємо персональні дані в правоохоронні, податкові, фіскальні та інші компетентні органи в тому обсязі і у тих випадках, як цього вимагає чинне законодавство України, зокрема, якщо це є необхідним для запобігання, виявлення або припинення злочинних дій і шахрайства. Окрім цього, персональні дані у відповідному обсязі можуть бути передані компетентним органам для захисту Наших прав або власності, а також прав і власності Партнерів Служба Таксі Лайт Юа.
                                    – Страхові компанії: шляхом підписання відповідних додатків до договору зі страховою компанією Ми передаємо Ваші персональні дані в тому обсязі, в якому це необхідно для страхування Вашого життя та здоров’я під час перевезення, а також шляхом письмового повідомлення страховій компанії Ваших персональних даних у разі настання страхового випадку в результаті замовлення Вами послуги доставки.
                                    – Захист Вашого життя та здоров’я під час перевезення: Ми можемо передавати Ваші персональні дані (ім’я, прізвище, номер телефону, маршрут поїздки та місцезнаходження) екстреним службам з метою порятунку Вашого життя або здоров’я та/або запобігання загрозі нанесення шкоди Вашому життю або здоров’ю під час поїздки, якщо Ви натиснули кнопку SOS у Мобільному додатку.
                                    – Фінансові компанії: Ми передаємо Вашу історію поїздок, інформацію по замовленню, а також дані, які підтверджують факт комунікації з Вами з приводу здійснених поїздок, в тому числі, але не виключно, скріншоти листувань електронною поштою та іншими засобами комунікації з переліком персональних даних, зазначених Вами під час реєстрації в онлайн сервісі Служба Таксі Лайт Юа , дату Вашої реєстрації на відповідні запити фінансових компаній – постачальників фінансових послуг з метою підтвердження здійснених Вами поїздок. Цим Ви надаєте згоду на передачу Нами зазначених скріншотів листувань фінансовим компаніям та підтверджуєте, що така передача не становитиме порушення таємниці листування.
                                    – Треті особи, що пропонують/надають Вам знижки (дисконти), та/або подарунки, та/або призи, та/або інші заохочення: Ми можемо передавати Ваші персональні дані (прізвище, ім’я, номер телефону) у порядку та обсязі, який є достатнім для надання Вам знижок (дисконтів) від існуючих (поточних) цін на товари та/або послуги таких третіх осіб, та/або подарунків, та/або призів, та/або інших заохочень, які пропонуються та надаються такими третіми особами.
                                    Б) Партнери Служба Таксі Лайт Юа .
                                    – Виконання замовлень: Ми передаємо Ваші персональні дані користувачам онлайн сервісу Служба Таксі Лайт Юа , замовлення яких Ви виконуєте.
                                    – Треті особи, що постачають послуги: Ми можемо використовувати послуги третіх осіб для обробки Ваших персональних даних від Нашого імені. Ця обробка відбувається для різних цілей, наприклад, для розсилки інформаційних матеріалів від Нашого імені і в Наших інтересах. Незалежні постачальники послуг погоджуються з обов’язковим дотриманням конфіденційності і не мають права використовувати Ваші персональні дані для інших цілей.
                                    – Компетентні органи державної влади: Ми передаємо персональні дані в правоохоронні, податкові, фіскальні та інші компетентні органи в тому обсязі і у тих випадках, як цього вимагає чинне законодавство України, зокрема, якщо це є необхідним для запобігання, виявлення або припинення злочинних дій і шахрайства. Окрім, цього персональні дані у відповідному обсязі можуть бути передані компетентним органам для захисту Наших прав або власності, а також прав і власності користувачів Веб-сайту та Мобільних додатків.
                                    – Страхові компанії: шляхом підписання відповідних додатків до договору зі страховою компанією Ми передаємо Ваші персональні дані в тому обсязі, в якому це необхідно для страхування Вашого життя та здоров’я під час перевезення, а також шляхом письмового повідомлення страхової компанії Ваших персональних даних в разі настання страхового випадку в результаті надання Вами послуги доставки.
                                    – Пошук залишених у автомобілі речей: на письмовий чи усний запит користувачів онлайн сервісу Служба Таксі Лайт Юа , Ми передаємо їм Ваше ім’я та номер телефону з метою сприяння у поверненні їм особистих речей, залишених в автомобілі під час перевезення. В інших випадках на письмовий чи усний запит користувачів онлайн сервісу Служба Таксі Лайт Юа  Ми можемо передати їм номер Вашого телефону лише в разі отримання Вашої окремої згоди.
                                    – Фінансові компанії: Ми передаємо історію виконаних замовлень, персональні дані, зазначені Вами під час реєстрації в онлайн сервісі Служба Таксі Лайт Юа , дані, що містяться у Вашому особистому кабінеті, а також дані, які підтверджують факт комунікації з Вами з приводу здійснених поїздок, в тому числі, але не виключно, скріншоти листувань електронною поштою та іншими засобами комунікації на відповідні запити фінансових компаній – постачальників фінансових послуг. Цим Ви надаєте згоду на передачу Нами зазначених скріншотів листувань фінансовим компаніям та підтверджуєте, що така передача не становитиме порушення таємниці листування.
                                    – Треті особи, що пропонують/надають Вам знижки (дисконти), та/або подарунки, та/або призи, та/або інші заохочення: Ми можемо передавати Ваші персональні дані (прізвище, ім’я, номер телефону) у порядку та обсязі, який є достатнім для надання Вам знижок (дисконтів) від існуючих (поточних) цін на товари та/або послуги таких третіх осіб, та/або подарунків, та/або призів, та/або інших заохочень, які пропонуються та надаються такими третіми особами.
                                    Навіщо Ми отримуємо Вашу згоду та як її можна відкликати?
                                    Приймаючи умови цього Положення під час реєстрації на Веб-сайті та/або в Мобільних додатках або при здійсненні замовлення через Веб-сайт без реєстрації, Ви надаєте однозначну згоду на збір, використання та обробку Нами Ваших персональних даних у відповідності до цього Положення і підтверджуєте, що, даючи таку згоду, Ви дієте за своєю волею і в своїх інтересах. Згода на обробку персональних даних надається Вами для здійснення будь-яких дій щодо персональних даних, які необхідні для досягнення вищевказаних цілей, включаючи, але не обмежуючись: збір, систематизацію, накопичення, зберігання, адаптування, уточнення (оновлення, зміна), використання, поширення (в тому числі шляхом реалізації або передачі), транскордонної передачі, знеособлення, блокування, знищення, а також здійснення будь-яких інших дій з персональними даними відповідно до чинного законодавства України.
                                    При обробці персональних даних Ми не обмежені у застосуванні способів їх обробки. Обробка персональних даних здійснюється з використанням засобів автоматизації.
                                    Вищевказана згода також включає Вашу згоду на внесення Вас до бази користувачів Веб-сайту та Мобільних додатків в день реєстрації на Веб-сайті та Мобільних додатках.
                                    Наступні види персональних даних можуть оброблятися лише на підставі Вашої окремої однозначної згоди у відповідь на Наше push-повідомлення: місцезнаходження, телефонна книга (контакти), запис на карту пам’яті. Ви можете будь-коли відкликати таку окрему згоду. Якщо Ви відкликали згоду, Ви не зможете користуватися будь-якими послугами чи функціями, які вимагають обробки персональних даних, які Ми зібрали на підставі окремої згоди.
                                    Ви можете відкликати свою згоду на обробку будь-яких персональних даних, а також на страхування свого життя та здоров’я (якщо застосовне) під час перевезення, відправивши відповідне повідомлення на електронну адресу: taxi.easy.ua.sup@gmail.com. Будь ласка, вкажіть «Відкликання згоди» у темі Вашого повідомлення, щоб прискорити Нашу відповідь.
                                    При цьому відкликання згоди на обробку персональних даних можливе лише стосовно майбутньої обробки персональних даних. Відкликання згоди не впливає на законність обробки персональних даних на підставі Вашої згоди до її відкликання або на інших законних підставах, передбачених чинним законодавством України.
                                    Зокрема, Ми маємо право не видаляти персональні дані в разі отримання від Вас повідомлення про відкликання згоди на обробку персональних даних або вимоги про видалення персональних даних, якщо обробка таких персональних даних необхідна для виконання зобов’язань, передбачених законодавством України або для захисту Наших законних інтересів або законних інтересів осіб, яким передаються дані, зокрема, для цілей бухгалтерського обліку та запобігання шахрайству.
                                    Оскільки деякі персональні дані, необхідні для надання доступу до онлайн-сервісу Служба Таксі Лайт Юа, Ваш обліковий запис буде видалено після відкликання згоди на обробку цих персональних даних.
                                    Персональні дані користувачів онлайн сервісу Служба Таксі Лайт Юа , без яких неможливо надання доступу до онлайн сервісу Служба Таксі Лайт Юа :
                                    • номер телефону – у разі здійснення замовлення через Мобільний додаток або Веб-сайт.
                                    • номер телефону та ім’я користувача – у разі здійснення замовлення через Веб-сайт без реєстрації користувачем в онлайн сервісі Служба Таксі Лайт Юа  .
                                    Персональні дані Партнерів Служба Таксі Лайт Юа (користувачів онлайн сервісу Служба Таксі Лайт Юа , без яких неможливо надання доступу до онлайн сервісу Служба Таксі Лайт Юа:
                                    • ім’я, прізвище, електронна адреса, номер телефону, місто, дані свідоцтва про реєстрацію транспортного засобу, дані посвідчення водія, дані договору обов’язкового страхування цивільно-правової відповідальності (ОСЦПВ), Ваше фото (зображення).
                                    У разі відкликання згоди на обробку інших персональних даних, Ваш обліковий запис залишається активним. Ми завжди будемо намагатися ідентифікувати запит, щоб переконатися, що він надходить від власника облікового запису. Якщо Ми не зможемо успішно ідентифікувати запит, Ми не зможемо здійснити відкликання згоди.
                                    Ви також можете звернутися до служби підтримки клієнтів на адресу електронної пошти taxi.easy.ua.sup@gmail.com  з проханням видалити свій обліковий запис. Після обробки Вашого запиту та проведення ідентифікації Ми видалимо Ваш обліковий запис, за винятком випадків, передбачених цим Положенням.
                                    Які у Вас права на Ваші персональні дані?
                                    Згідно зі статтею 8 Закону Ви маєте право:
                                    • знати про джерела збирання, місцезнаходження своїх персональних даних, мету їх обробки, місцезнаходження або місце проживання (перебування) володільця чи розпорядника персональних даних або дати відповідне доручення щодо отримання цієї інформації уповноваженим ним особам, крім випадків, встановлених законом;
                                    • отримувати інформацію про умови надання доступу до персональних даних, зокрема інформацію про третіх осіб, яким передаються Ваші персональні дані;
                                    • на доступ до своїх персональних даних;
                                    • отримувати не пізніш як за тридцять календарних днів з дня надходження запиту, крім випадків, передбачених законом, відповідь про те, чи обробляються Ваші персональні дані, а також отримувати зміст таких персональних даних;
                                    • пред’являти вмотивовану вимогу володільцю персональних даних із запереченням проти обробки своїх персональних даних;
                                    • пред’являти вмотивовану вимогу щодо зміни або знищення своїх персональних даних будь-яким володільцем та розпорядником персональних даних, якщо ці дані обробляються незаконно чи є недостовірними;
                                    • на захист своїх персональних даних від незаконної обробки та випадкової втрати, знищення, пошкодження у зв’язку з умисним приховуванням, ненаданням чи несвоєчасним їх наданням, а також на захист від надання відомостей, що є недостовірними чи ганьблять честь, гідність та ділову репутацію фізичної особи;
                                    • звертатися із скаргами на обробку своїх персональних даних до Уповноваженого або до суду;
                                    • застосовувати засоби правового захисту в разі порушення законодавства про захист персональних даних;
                                    • вносити застереження стосовно обмеження права на обробку своїх персональних даних під час надання згоди;
                                    • відкликати згоду на обробку персональних даних;
                                    • знати механізм автоматичної обробки персональних даних;
                                    • на захист від автоматизованого рішення, яке має для Вас правові наслідки.
                                    Як Ви можете контролювати персональні дані, які Нам надали?
                                    У Вас завжди є право на доступ до своїх персональних даних, які Ми обробляємо. Ви можете надіслати запит щодо персональних даних, відправивши Нам листа електронною поштою за наступною адресою:taxi.easy.ua.sup@gmail.com. Зазначте в темі листа «Запит на отримання персональних даних», щоб прискорити процес.

                                    Строки зберігання персональних даних:
                                    А) Користувачі онлайн сервісу Служба Таксі Лайт Юа
                                    Ваші персональні дані зберігаються протягом періоду, необхідного для досягнення цілей обробки або протягом встановленого строку зберігання інформації, якщо це передбачено чинним законодавством, за винятком даних про IP-адресу, які зберігаються протягом трьох тижнів з моменту здійснення замовлення. Якщо Ваш акаунт видалений, Ваші персональні дані будуть також видалені з нашої бази даних через 3 (три) роки після цього, за винятком випадків, коли наявні законні підстави для продовження їх обробки, наприклад, для виконання Наших зобов’язань, передбачених чинним законодавством.
                                    Після досягнення цілей обробки або закінчення вищевказаного трирічного строку чи встановленого законом строку зберігання персональних даних Ми анонімізуємо (знеособлюємо) Ваші персональні дані, щоб вони більше не могли бути пов’язані з Вами особисто. В цьому випадку Ми зможемо використовувати цю інформацію для таргетингу рекламних та/або інформаційних матеріалів, зі статистичною, аналітичною або дослідницькою метою, без подальшого інформування Вас, оскільки така інформація перестане становити персональні дані.
                                    Видалення Мобільного додатку на Вашому пристрої не призводить до видалення Ваших персональних даних.
                                    Якщо Ви використовуєте своє право на видалення Ваших персональних даних, Ми видалимо Ваші персональні дані, які були Нами оброблені для цілі проти якої Ви заперечували, без зволікання, за відсутності іншої правової підстави для зберігання та обробки цих даних або вимоги зберігати ці дані, передбаченої чинним законодавством.
                                    Б) Партнери Служба Таксі Лайт Юа.
                                    Ваші персональні дані зберігаються протягом періоду, необхідного для досягнення цілей обробки або протягом встановленого строку зберігання інформації, якщо це передбачено чинним законодавством, за винятком даних про IP-адресу, які зберігаються протягом трьох тижнів з моменту здійснення замовлення. Якщо Ваш особистий кабінет видалений, персональні дані також будуть видалені з нашої бази даних через 3 (три) роки після цього, за винятком випадків, коли наявні законні підстави для продовження їх обробки, наприклад, для виконання Наших зобов’язань, передбачених чинним законодавством.
                                    Після досягнення цілей обробки або закінчення вищевказаного трирічного строку чи встановленого законом строку зберігання персональних даних Ми анонімізуємо (знеособлюємо) Ваші персональні дані, щоб вони більше не могли бути пов’язані з Вами особисто. В цьому випадку Ми зможемо використовувати цю інформацію для таргетингу рекламних та/або інформаційних матеріалів, зі статистичною, аналітичною або дослідницькою метою без подальшого інформування Вас, оскільки така інформація перестане становити персональні дані.
                                    Видалення Мобільного додатку на Вашому пристрої не призводить до видалення Ваших персональних даних.
                                    Якщо Ви використовуєте своє право на видалення Ваших персональних даних, Ми видалимо Ваші персональні дані, які були Нами оброблені для цілі проти якої Ви заперечували, без зволікання, за відсутності іншої правової підстави для зберігання та обробки цих даних або вимоги зберігати ці дані, передбаченої чинним законодавством.
                                    Місцезнаходження Ваших персональних даних:
                                    Ми дбаємо про безпеку Ваших персональних даних і тому Ми зберігаємо Ваші персональні дані на серверах, які знаходяться в країнах Європейського Союзу.
                                    Також ми можемо передавати Ваші персональні дані до інших країн, але виключно для цілей обробки даних, передбачених цим Положенням або чинним законодавством. Цим Ви надаєте свою однозначну згоду на передачу (а також обробку та зберігання) Ваших персональних даних за межі України, включно до юрисдикцій, які не визнані такими, що забезпечують належний захист даних. Разом з тим, Ми завжди вживаємо заходів щодо належного захисту Ваших даних.
                                    Як Ми захищаємо Ваші персональні дані?
                                    Ми знаємо, що безпека важлива для Наших користувачів, і Ми піклуємось про безпеку Ваших персональних даних. Ми застосовуємо технічні, фізичні та адміністративні заходи безпеки для захисту Ваших персональних даних від втрати, неправильного використання, несанкціонованого доступу, розголошення або зміни. Деякі заходи, що Ми застосовуємо, включають міжмережеві засоби захисту, шифрування даних, контроль фізичного доступу до Наших центрів обробки даних та засоби контролю доступу до персональних даних.
                                    Доступ до персональних даних надається структурним підрозділам та/або окремим працівникам, для виконання ними своїх функціональних обов’язків, що пов’язані з виконанням Наших договірних, юридичних зобов’язань. Кожен працівник/уповноважена особа, яка має доступ до персональних даних підписує зобов’язання щодо нерозголошення інформації, до якої він має доступ під час виконання функціональних обов’язків.
                                    Нам також потрібна Ваша допомога – саме Ви зобов’язані переконатися, що Ваша персональна інформація є точною, а Ваш пароль та інформація про реєстрацію облікового запису є безпечними і не надається стороннім особам.
                                    Якщо при здійсненні замовлення на перевезення через онлайн сервіс Служба Таксі Лайт Юа  Ви розраховуєтесь з Партнером Служба Таксі Лайт Юа  банківською картою, Ви автоматично переходите на веб-сайт відповідного постачальника фінансових послуг та надаєте Ваші персональні дані та дані банківської карти безпосередньо на веб-сайті цього постачальника фінансових послуг.
                                    Веб-сайт чи Мобільні додатки не збирають жодних даних щодо Ваших банківських карток. Партнери Служба Таксі Лайт Юа, що приймають участь у бонусній програмі можуть за певних умов надавати Нам дані своєї банківської карти.

                                    Як Ми відносимося до персональних даних дітей?
                                    Ми суворо дотримуємося захисту персональних даних дітей. Ми свідомо не збираємо, не обробляємо та не зберігаємо персональні дані осіб, молодше 18 років.
                                    Веб-сайт та Мобільні додатки не призначені для використання особами, молодше 18 років.
                                    Якщо Вам не виповнилося 18 років, будь ласка, не використовуйте та не отримуйте доступ до Веб-сайтів або Мобільних додатків будь-коли та будь-яким способом.
                                    Якщо батьки або законний опікун вважає, що їх дитина отримала доступ до Веб-сайту та/або Мобільних додатків і надала свої персональні дані, Ми наполегливо рекомендуємо батькам або законному опікуну негайно зв’язатися з Нами, і Ми докладемо всіх зусиль, щоб негайно видалити такі персональні дані.
                                    Файли cookie
                                    Ми можемо використовувати файли cookie, веб-маяки, теги, скрипти, локальні спільні об’єкти, такі як HTML5, та рекламні ідентифікатори (включаючи мобільні ідентифікатори, такі як Apple’s IDFA або Google’s Advertising ID) і подібні технології (надалі – «Cookie») у зв’язку з використанням Веб-сайту або Мобільних додатків для певних цілей: Ваша аутентифікація, запам’ятовування Ваших налаштувань та інших цілей, вказаних нижче.
                                    Файл Сookie – це невеликий фрагмент даних, який надсилається в браузер на Вашому комп’ютері або мобільному пристрої. Файли Сookie, що належать Веб-сайту чи Мобільним додаткам, є основними. Файли Сookie, які Ми дозволяємо іншим організаціям відправляти через Веб-сайт, називаються “додаткові файли Сookie”.
                                    Крім того, розрізняють файли Сookie сеансу і постійні. Файли Сookie сеансу діють до тих пір, поки Ви не закриєте браузер або Мобільний додаток. У постійних файлів Сookie більш тривалий термін дії: вони не видаляються автоматично при закритті браузера.
                                    «Software Development Kits» (SDKs) функціонують як пікселі та файли Сookie, але працюють у середовищі мобільних додатків, де пікселі та файли Сookie не завжди можуть функціонувати. Розробник основної програми може встановлювати фрагменти коду (SDK) від партнерів у додатку і тим самим дозволяти партнеру збирати певну інформацію про взаємодію користувача з програмою та інформацію про пристрої користувача та інформацію про мережу.
                                    Файли Сookie використовуються для різних цілей. Вони допомагають розпізнавати Вас як одного і того ж користувача на різних сторінках Веб-сайту чи при користуванні Мобільними додатками.
                                    Веб-сайт і Мобільні додатки використовують файли Сookie в різних цілях:
                                    • Технічні файли Сookie: Ми хочемо, щоб Наші користувачі могли користуватися сучасними, зручними сайтами і додатками, які автоматично пристосовуються до їхніх потреб. Ми використовуємо технічні файли Сookie, щоб Веб-сайт та Мобільні додатки правильно відображалися і працювали без помилок, а також щоб Ви могли створити акаунт, входити в нього та керувати своїми замовленнями. Технічні файли Сookie необхідні для того, щоб забезпечити безпомилкову роботу Веб-сайту і Мобільних додатків.
                                    • Функціональні файли Сookie: вони необхідні для того, щоб запам’ятовувати Ваші вподобання і допомагати Вам ефективно користуватися Веб-сайтом і Мобільними додатками. Ми можемо використовувати їх для того, щоб запам’ятати Ваші персональні дані і позбавити Вас необхідності кожного разу вводити ім’я користувача і пароль. При цьому Ваш пароль завжди буде зашифрований. Функціональні файли Сookie не обов’язкові для роботи доступу до oнлайн-сервісу Служба Таксі Лайт Юа, але вони роблять Веб-сайт та Мобільні додатки більш функціональними і зручними у користуванні.
                                    • Аналітичні файли Сookie: вони необхідні для того, щоб дізнатися в який спосіб відвідувачі використовують Веб-сайт чи Мобільні додатки. Ми можемо зрозуміти наскільки добре працюють різні функції, оптимізувати роботу Веб-сайту і Мобільних додатків, аналізувати рекламу і комунікації. Аналітичні файли Сookie допомагають Нам упевнитися, що Веб-сайт і Мобільні додатки цікаві і корисні для користувачів.
                                    • Маркетингові файли Сookie: Ми використовуємо ці файли для передачі інформації, листів з новинами, рекламних та промо матеріалів або для виконання рекламних кампаній. Наприклад, Ми можемо покладатися на інформацію, отриману за допомогою цих файлів Сookie, для передачі Вам інформації, листів з новинами, рекламних та промо матеріалів, які можуть бути цікавими для Вас.
                                    Це також означає, що Ми можемо використовувати дані про те, як Ви взаємодієте з Веб-сайтом, зокрема, кількість натискань на сторінці, руху мишки і прокручування, пошукові слова й інший текст, який Ви вводите в різні поля.
                                    Для користувачів Мобільного додатку Служба Таксі Лайт Юа, за допомогою операційної системи мобільного пристрою Ви можете обрати, дозволяти використовувати файли Сookie чи ділитися з Нами, або Нашими постачальниками рекламних послуг Вашим рекламним ідентифікатором.
                                    Якщо Ви не бажаєте, щоб Ваші персональні дані були зібрані за допомогою файлів Сookie на Веб-сайті, Ви можете деактивувати файли Сookie, налаштувавши Ваш інтернет-браузер так, щоб вимкнути, блокувати або деактивувати файли Сookie, видаливши історію перегляду та очистивши кеш з Вашого інтернет-браузера. Ви також можете обмежити обмін деякими з цих даних за допомогою налаштувань мобільного пристрою.
                                    Як з Нами зв’язатися?
                                    Питання, коментарі та запити щодо цього Положення вітаються та направляються в Нашу службу підтримки клієнтів на адресу електронної пошти: taxi.easy.ua.sup@gmail.com
                                    Якщо Ви вважаєте, що Ми порушили умови цього Положення, звертайтеся до Нас та повідомте, які саме умови цього Положення було порушено. Ми оперативно розглянемо Вашу скаргу.
                                </p>

                                <p class="lead" style="text-align: justify">
                                    Ми докладаємо всіх необхідних заходів для забезпечення безпеки ваших особистих даних та запобігання несанкціонованому доступу до них.
                                </p>

                                <p class="lead" style="text-align: justify">
                                    Наш додаток дотримується положень Загального регламенту захисту персональних даних <a href="https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:32016R0679">(GDPR)</a> Європейського Союзу щодо збору, використання та обробки особистих даних.

                                </p>

                                <p class="lead" style="text-align: justify">
                                    Ви маєте право в будь-який час запросити доступ до ваших особистих даних, внести зміни або видалити їх з нашої бази даних. Для цього зв'яжіться з нами за адресою taxi.easy.ua.sup@gmail.com.
                                </p>

                                <p class="lead" style="text-align: justify">
                                    Використовуючи нашу програму, ви погоджуєтесь з умовами нашої політики конфіденційності. Ми залишаємо за собою право вносити зміни до цієї політики, про що ви будете повідомлені.
                                </p>
                                <p class="lead" style="text-align: justify">
                                    Ви маєте право в будь-який час запросити доступ до ваших особистих даних, внести зміни або видалити їх з нашої бази даних. Для цього зв'яжіться з нами за адресою taxi.easy.ua.sup@gmail.com.
                                </p>
                                <p class="lead" style="text-align: justify">
                                    Якщо у вас є додаткові запитання або запити щодо вашої конфіденційності та даних, будь ласка, зв'яжіться з нами за вказаною нижче контактною адресою.
                                </p>

                                <p class="lead" style="text-align: justify">
                                    Дата набрання чинності: 01/01/2023
                                </p>
                                <p class="lead" style="text-align: justify">
                                    Контактна інформація: taxi.easy.ua.sup@gmail.com
                                <p class="lead"> Будь ласка, ознайомтесь з
                                    <a href="{{ route('taxi-umovy') }}">Умовами користування сервісом.</a>
                                </p>
                            </div>
                        </div>
                    </div>
                    <div class="container-fluid" style="margin: 10px">
                        <a href="{{route('homeCombo')}}"
                           target="_blank" style="text-decoration: none; color: black">
                            <h5 style="text-align: center; " class="gradient">
                                <b>Служба Таксі Лайт Юа – це завжди надійно, комфортно та вигідно. <br>
                                    Замовьте таксі прям зараз.</b>
                            </h5>
                        </a>
                    </div>
                    <br>
                </div>
            </div>
        </div>

    </div>


    <script>
        let slideIndex = 0;
        showSlides();

        function showSlides() {
            let i;
            let slides = document.getElementsByClassName("mySlides");
            let dots = document.getElementsByClassName("dot");
            for (i = 0; i < slides.length; i++) {
                slides[i].style.display = "none";
            }
            slideIndex++;
            if (slideIndex > slides.length) {slideIndex = 1}
            for (i = 0; i < dots.length; i++) {
                dots[i].className = dots[i].className.replace(" active", "");
            }
            slides[slideIndex-1].style.display = "block";
            dots[slideIndex-1].className += " active";
            setTimeout(showSlides, 2000); // Change image every 5 seconds
        }
    </script>

@endsection
