@extends('layouts.taxiNewCombo')

@section('content')

    <div class="container-fluid">
        <div class="row">
            @include ('layouts.services')

            <div class="col-lg-9 col-sm-6 col-md-9" >

                <div class="container-fluid">
                    <a href="{{route('homeCombo')}}"
                       style="text-decoration: none">
                        <h4 class="text-center text-primary gradient"> <b>Пропонуємо Вам найсучасніший
                                сервіс організації поїздок на комфортабельних авто за доступними цінами.</b></h4>
                    </a>

                </div>
                <div class="container" style="background-color: hsl(0, 0%, 96%)">
                    <br>
                    <div class="container" style="text-align: center">
                        <h1 class="gradient"><b>Політика конфіденційності</b></h1>
                    </div>
                    <div class="container">
                        <div class="row gx-lg-5 align-items-center">
                            <div class="text-center">

                                <h3>1. Збір та використання особистих даних</h3>
                                <p class="lead" style="text-align: justify">
                                    Ми цінуємо вашу довірливість та прагнемо забезпечити надійний захист ваших особистих даних. Ця політика конфіденційності пояснює, як ми збираємо, використовуємо та захищаємо ваші особисті дані в рамках використання нашої програми.
                                </p>
                                <h3>2. Збірні дані</h3>
                                <p class="lead" style="text-align: justify">
                                    Для забезпечення функціональності замовлення таксі у нашому додатку, ми збираємо та зберігаємо номери мобільних телефонів користувачів. Ці дані необхідні для зв'язку з вами та забезпечення послуги замовлення таксі.
                                </p>
                                <h3>3. Передача даних</h3>
                                <p class="lead" style="text-align: justify">
                                    Ваші номери мобільних телефонів передаються нашому диспетчеру для пошуку доступних автомобілів для виконання замовлення таксі. Ми гарантуємо, що ваші особисті дані будуть використані виключно в рамках надання послуги замовлення таксі.
                                </p>
                                <h3>4. Згода на обробку даних</h3>
                                <p class="lead" style="text-align: justify">
                                    Використовуючи нашу програму та надаючи нам свої особисті дані, ви висловлюєте свою згоду на збір, використання та передачу цих даних відповідно до цієї політики конфіденційності.
                                </p>
                                <h3>5. Захист даних</h3>
                                <p class="lead" style="text-align: justify">
                                    Ми докладаємо всіх необхідних заходів для забезпечення безпеки ваших особистих даних та запобігання несанкціонованому доступу до них.
                                </p>
                                <h3>6. Застосовність законодавства</h3>
                                <p class="lead" style="text-align: justify">
                                    Наш додаток дотримується положень Загального регламенту захисту персональних даних <a href="https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:32016R0679">(GDPR)</a> Європейського Союзу щодо збору, використання та обробки особистих даних.

                                </p>
                                <h3>7. Ваші права</h3>
                                <p class="lead" style="text-align: justify">
                                    Ви маєте право в будь-який час запросити доступ до ваших особистих даних, внести зміни або видалити їх з нашої бази даних. Для цього зв'яжіться з нами за адресою taxi.easy.ua@gmail.com.
                                </p>
                                <h3>8. Згода та зміни</h3>
                                <p class="lead" style="text-align: justify">
                                    Використовуючи нашу програму, ви погоджуєтесь з умовами нашої політики конфіденційності. Ми залишаємо за собою право вносити зміни до цієї політики, про що ви будете повідомлені.
                                </p>
                                <p class="lead" style="text-align: justify">
                                    Ви маєте право в будь-який час запросити доступ до ваших особистих даних, внести зміни або видалити їх з нашої бази даних. Для цього зв'яжіться з нами за адресою taxi.easy.ua@gmail.com.
                                </p>
                                <p class="lead" style="text-align: justify">
                                    Якщо у вас є додаткові запитання або запити щодо вашої конфіденційності та даних, будь ласка, зв'яжіться з нами за вказаною нижче контактною адресою.
                                </p>

                                <p class="lead" style="text-align: justify">
                                    Дата набрання чинності: 01/01/2023
                                </p>
                                <p class="lead" style="text-align: justify">
                                    Контактна інформація: taxi.easy.ua@gmail.com
                                <p class="lead"> Будь ласка, ознайомтесь з
                                    <a href="{{ route('taxi-umovy') }}">Умовами користування сервісом.</a>
                                </p>
                            </div>
                        </div>
                    </div>
                    <div class="container-fluid" style="margin: 10px">
                        <a href="{{route('homeCombo')}}"
                           target="_blank" style="text-decoration: none; color: black">
                            <h5 style="text-align: center; " class="gradient">
                                <b>Служба Таксі Лайт Юа – це завжди надійно, комфортно та вигідно. <br>
                                    Замовьте таксі прям зараз.</b>
                            </h5>
                        </a>
                    </div>
                    <br>
                </div>

                <div class="container" style="background-color: hsl(0, 0%, 96%)">
                    <div class="text-center">
                        <h1 class="gradient">Умови користування (оферта).</h1>
                    </div>
                    <div class="container">
                        <div class="row gx-lg-5 align-items-center">
                            <div class="text-center">
                                <h3>1. Загальні положення щодо умов користування сайтом.</h3>

                                <p style="text-align: justify">
                                    Користування цим веб-сайтом та контентом і послугами, що пропонуються
                                    , можливе тільки на таких умовах. При доступі до цього веб-сайта або будь-якої його сторінки
                                    нижчого рівня користувач погоджується з умовами користування у їхній редакції, чинній на момент
                                    користування. Якщо користувач не згодний хоча б з одним положенням цих умов, користування
                                    сайтом повинно бути негайно припинене. Фізична особа-підприємець Коржов Андрій Анатолійович
                                    (код ДРФО 260714759) зберігає за собою право змінювати або редагувати ці умови у будь-який час
                                    без попереднього сповіщення.</p>

                                <h3>2. Послуги, що надаються.</h3>

                                <p style="text-align: justify">
                                    Фізична особа-підприємець Коржов Андрій Анатолійович (код ДРФО 260714759)
                                    пропонує контент та інформацію на цьому веб-сайті для комерційних та інформаційних цілей, зберігає
                                    Фізична особа-підприємець Коржов Андрій Анатолійович (код ДРФО 260714759)
                                    за собою право припиняти або обмежувати функціонування цього веб-сайта і не несе відповідальності
                                    за постійне і незмінне функціонування цього веб-сайта або будь-яких матеріалів цього веб-сайта
                                    без перерв і збоїв.
                                </p>

                                <h3>3. Рамки користування веб-сайтом.</h3>

                                <p style="text-align: justify">
                                    Контент та інформація веб-сайта призначені для особистого
                                    некомерційного використання користувачем та не може завантажуватися з копіюванням ("скачуватися"),
                                    копіюватися, оброблятися або розповсюджуватися для комерційного використання, з єдиним винятком
                                    для тих матеріалів контенту, які спеціально призначені для скачування та які особливим чином
                                    помічені як призначені для цього. Користувач має право роздруковувати частини веб-сайта для
                                    особистого користування.
                                </p>

                                <p style="text-align: justify">
                                    Фізична особа-підприємець Коржов Андрій Анатолійович (код ДРФО 260714759)
                                    заявляє, що контент цього веб-сайта, тобто текст, зображення, графіка та шаблони є об'єктом
                                    автрського права або власністю Фізичної особи-підприємця Коржова Андрія Анатолійовича (код ДРФО 260714759).
                                    або іншим чином захищені правом власності.
                                </p>

                                <h3>4. Гарантія та відповідальність.</h3>

                                <p style="text-align: justify">
                                    Веб-сайт відображає статус інформації та стан технології на час публікації. Фізична особа-підприємець
                                    Коржов Андрій Анатолійович (код ДРФО 260714759) не несе відповідальності за вибір
                                    питань, точність та повноту матеріалів. Фізична особа-підприємець Коржов Андрій Анатолійович (код ДРФО 260714759)
                                    не несе відповідальності ні за яку шкоду або збитки будь-якої природи, які користувач може
                                    зазнавати під час або у зв'язку з використанням веб-сайта та його сторінок нижчих рівнів.
                                </p>

                                <h3>5. Посилання на інші веб-сторінки.</h3>

                                <p style="text-align: justify">
                                    У деяких частинах веб-сайта існують гіперлінки на інші веб-сторінки з додатковою інформацією,
                                    яка може становити інтерес для користувача. Користуючись цими посиланням, тобто "клацаючи"
                                    на відповідні лінки на ці веб-сторінки, користувач залишає веб-сторінку
                                    Фізичної особи-підприємця Коржова Андрія Анатолійовича (код ДРФО 260714759).
                                </p>
                                <p style="text-align: justify">
                                    Фізична особа-підприємець Коржов Андрій Анатолійович (код ДРФО 260714759) не має впливу на
                                    поточні і майбутні матеріали веб-сайтів, що перебувають під управлінням третіх сторін.
                                    З цієї причини  Фізична особа-підприємець Коржов Андрій Анатолійович (код ДРФО 260714759)
                                    не бере на себе жодної відповідальності за матеріали таких веб-сторінок третіх сторін і не несе
                                    жодної відповідальності за шкоду.
                                </p>

                                <h3>6. Обов'язки користувача.</h3>

                                <p style="text-align: justify">
                                    Користувач веб-сайта зобов'язаний, при кожному користуванні веб-сайтом або послугами, що
                                    пропонуються, діяти у законний спосіб. Користувач не має права використовувати механізми,
                                    програмне забезпечення або інші прийоми, які при взаємодії з веб-сайтом можуть завдати йому
                                    шкоди або виходу з ладу. Це також стосується будь-яких навмисних заходів, які завдають
                                    надмірного навантаження технічній інфраструктурі веб-сайта.
                                </p>

                                <h3>7. Захист даних.</h3>

                                <p style="text-align: justify">
                                    Веб-сайт можна відвідувати та користуватися ним без введення жодної особистої інформації.
                                    Деякі частини веб-сайта, які пропонують скачування інформації або послуг, можуть вимагати
                                    введення користувачем особистих даних для отримання цих послуг або доступу до особливих розділів
                                    або реєстрації як користувача із захистом паролем.
                                </p>
                                <p style="text-align: justify">
                                    Виконуючи ці дії користувач погоджується с
                                    <a href="{{ route('taxi-gdbr') }}">Правиламі конфедійціності</a> на цьому сайті  та усвідомлює
                                    з якою метою збираються дані, а також те, чи введення інформації є добровільним або обовязковим
                                    для користування відповідною послугою.
                                </p>
                                <p style="text-align: justify">
                                    Фізична особа-підприємець Коржов Андрій Анатолійович (код ДРФО 260714759) зберігає та використовує
                                    особисті дані про користувача тільки з конкретною метою, про яку користувач мав намір, тобто дав
                                    свою згоду. Використання особистих даних з будь-якою іншою метою може здійснюватися лише тоді,
                                    коли це є законним. Усі дані користувача зберігаються у таємниці і можуть бути передані працівникам
                                    Фізичної особи-підприємця Коржова Андрія Анатолійовича (код ДРФО 260714759) або їхнім представникам
                                    тільки тоді, коли це є необхідним для певної чітко обумовленої мети, намір про яку має користувач.
                                    Ці дані не передаються жодним третім сторонам, крім випадків, коли Фізична особа-підприємець
                                    Коржов Андрій Анатолійович (код ДРФО 260714759) зобов'язана це зробити згідно із вимогами закону.
                                </p>
                                <p style="text-align: justify">
                                    Користувач має право у будь-який відкликати свою згоду на угоду про використання і
                                    зберігання особистих даних, і Фізична особа-підприємець Коржов Андрій Анатолійович (код ДРФО 260714759)
                                    повинна негайно знищити інформацію після отримання
                                    повідомлення про таке відкликання.
                                </p>
                            </div>
                        </div>
                    </div>
                    <br>
                </div>
            </div>
        </div>

    </div>


    <script>
        let slideIndex = 0;
        showSlides();

        function showSlides() {
            let i;
            let slides = document.getElementsByClassName("mySlides");
            let dots = document.getElementsByClassName("dot");
            for (i = 0; i < slides.length; i++) {
                slides[i].style.display = "none";
            }
            slideIndex++;
            if (slideIndex > slides.length) {slideIndex = 1}
            for (i = 0; i < dots.length; i++) {
                dots[i].className = dots[i].className.replace(" active", "");
            }
            slides[slideIndex-1].style.display = "block";
            dots[slideIndex-1].className += " active";
            setTimeout(showSlides, 2000); // Change image every 5 seconds
        }
    </script>

@endsection
