<?php

namespace App\Http\Controllers;

use App\Models\NewsList;
use App\Models\Quite;
use Illuminate\Database\Eloquent\Model;
use Illuminate\Http\Request;

class BredoGeneratorController extends Controller
{
    /**
     * @throws \Exception
     */
    public function textGenerate()
    {
        /**
         * Новости
         */


        $keyWordsArr = ['такси', 'uklon', 'болт такси', 'уклон такси', 'такси болт', 'убер', 'такси макси',
            'такси уклон', '838 такси', 'такси 838', 'убер такси', 'такси белая церковь', 'он такси', 'уклон телефон',
            'номер такси', 'bolt такси', 'uklon номер телефона', 'заказать такси', 'такси десятка',
            'такси болт номер телефона', 'такси уклон телефон', 'uklon драйвер', 'вызвать такси', 'такси онлайн',
            'эконом такси', 'uklon такси', 'такси болт номер', '292 такси', 'такси максим номер', 'такси 292',
            'служба поддержки болт', 'uber такси', 'такси убер', 'дешевое такси', 'болт такси телефон',
            '579 такси', 'уклон для водителей', 'любимое такси', 'таксометр', 'служба такси', 'желтое такси',
            'мое такси', 'оптима такси', 'uklon личный кабинет', 'uklon онлайн', 'такси эконом', 'такси межгород',
            'экспресс такси', 'shark taxi', 'номер такси болт', 'вызов такси', 'самое дешевое такси',
            'такси оптимальное', 'такси uber', 'такси заказать', 'онлайн такси'];

      //  dd($keyWordsArr[random_int(0, count($keyWordsArr) - 1)]);

        $quitesArr = Quite::all()->toArray(); //Заголовки

        $shortNews = "📢 " . mb_convert_case($keyWordsArr[rand(0, count($keyWordsArr) - 1)], MB_CASE_TITLE, "UTF-8") . ". "
            . $quitesArr[rand(0, count($quitesArr) - 1)]['name'];

        $newsArr = NewsList::all()->toArray(); //Старые новости

        $fullNews = "🚧 ";
        for ($i = 0; $i < 10; $i++) {
            $fullNewsArr[$i] = explode('.', $newsArr[rand(0, count($newsArr) - 1)]['full']);

            $randomText = " " . $keyWordsArr[rand(0, count($keyWordsArr) - 1)] . ". ";

            $fullNews = $fullNews . $fullNewsArr[$i][rand(0, count($fullNewsArr[$i]) - 1)] . $randomText ;
        }

        $author = "🚖 Служба Таксі Лайт Юа";

        return [$shortNews, $fullNews, $author];
    }
}
