<?php

namespace App\Http\Controllers;

use App\Models\NewsList;
use App\Models\Quite;
use Illuminate\Database\Eloquent\Model;
use Illuminate\Http\Request;

class BredoGeneratorController extends Controller
{
    /**
     * @throws \Exception
     */
    public function textGenerate(): array
    {
        /**
         * Новости
         */


        $keyWordsArr = ['такси', 'uklon', 'болт такси', 'уклон такси', 'такси болт', 'убер', 'такси макси',
            'такси уклон', '838 такси', 'такси 838', 'убер такси', 'такси белая церковь', 'он такси', 'уклон телефон',
            'номер такси', 'bolt такси', 'uklon номер телефона', 'заказать такси', 'такси десятка',
            'такси болт номер телефона', 'такси уклон телефон', 'uklon драйвер', 'вызвать такси', 'такси онлайн',
            'эконом такси', 'uklon такси', 'такси болт номер', '292 такси', 'такси максим номер', 'такси 292',
            'служба поддержки болт', 'uber такси', 'такси убер', 'дешевое такси', 'болт такси телефон',
            '579 такси', 'уклон для водителей', 'любимое такси', 'таксометр', 'служба такси', 'желтое такси',
            'мое такси', 'оптима такси', 'uklon личный кабинет', 'uklon онлайн', 'такси эконом', 'такси межгород',
            'экспресс такси', 'shark taxi', 'номер такси болт', 'вызов такси', 'самое дешевое такси',
            'такси оптимальное', 'такси uber', 'такси заказать', 'онлайн такси'];

        $textArr = [
            "Можливість оформити замовлення таксі на бажаний час та день.
            Зручно при поїздках до аеропортів та вокзалів Києва. Швидко, надійно та недорого. Розрахуйте точну вартість на сайті.
            Нерідкі випадки, коли поїздка планується заздалегідь. Найчастіше автомобіль таксі потрібно безпосередньо перед виходом. Вам неодмінно підійде послуга попереднє замовлення таксі, яка допоможе спланувати і викликати службу «Таксі Лайт Юа» на необхідний час.
            Якщо ви вирішили спланувати свою поїздку заздалегідь, то на сторінках нашого сайту Ви можете розрахувати точну вартість поїздки, а також оформити попереднє замовлення таксі. Для цього буде потрібно вказати маршрут майбутньої поїздки, а також дату та час. Служба «Таксі Лайт Юа» пропонує найбільш доступні ціни таксі, а також ви можете заздалегідь замовити будь-який з класів авто (економ, стандарт та преміум класу).
            Попереднє замовлення можна оформити за допомогою форми на нашому сайті, або залишити свій номер у формі обратного зв'язку на сайті. Оператор розрахує точну вартість та підбере найбільш підходящий автомобіль.Професійний водій нашої служби акуратно та швидко пережене за вказаною адресою або на найближче паркування Ваш автомобіль. Замовити на сайті.
            Якщо хочеться відпочити та повеселитися на незапланованому заході що робити з автомобілем, адже залишити його на парковці біля ресторану або просто залишити у дороги не хочеться? В такому випадку вам неодмінно варто скористатися послугою Тверезий водій від служби «Таксі Лайт Юа». Професійний водій оперативно прибуде та сяде за кермо вашого автомобіля, доставивши його на найближчу парковку під ваш будинок. Це зручно та безпечно, а зі службою «Таксі Лайт Юа», ще надійно та економно.
            Якщо ви вирішили спланувати свою поїздку заздалегідь, то на сторінках нашого сайту Ви можете розрахувати точну вартість поїздки, а також оформити попереднє замовлення таксі. Для цього буде потрібно вказати маршрут майбутньої поїздки, а також дату і час. Служба «Таксі Лайт Юа» пропонує найбільш доступні ціни таксі, а також ви можете заздалегідь замовити будь-який з класів авто економ, стандарт та преміум класу.
            Попереднє замовлення можна оформити за допомогою форми на нашому сайті, або залишити свій номер на сайті. Оператор розрахує точну вартість і підбере найбільш підходящий автомобіль. Кожна поїздка на вокзал є дуже важливою . Кожен з нас заздалегідь прагне все спланувати, щоб не виникло неприємних сюрпризів, адже ніяк не можна запізнитися на потяг. Зі службою «Таксі Лайт Юа» ви можете не хвилюватися, ми пропонуємо якісний сервіс, швидку подачу та ціни таксі економ, стандарт та преміум класу.
            Найправильнішим рішенням буде попереднє замовлення таксі на вокзал в службі «Таксі Лайт Юа». Це дасть можливість заздалегідь розрахувати вартість та подбати про майбутню поїздку. Водій візьме ваше замовлення заздалегідь та складе свій маршрут так, щоб прибути без запізнень. Попереднє замовлення таксі на вокзал позбавить вас від пошуку найближчого вільного автомобіля.
            Попереднє замовлення можна оформити за допомогою форми на нашому сайті, або залишити свій номер у формі обратного зв'язку на сайті. Оператор розрахує точну вартість та підбере найбільш підходящий автомобіль. Кожна поїздка в аеропорт є дуже важливою . Кожен з нас заздалегідь прагне все спланувати, щоб не виникло неприємних сюрпризів, адже ніяк не можна запізнитися на літак. Зі службою «Таксі Лайт Юа» ви можете не хвилюватися, ми пропонуємо якісний сервіс, швидку подачу та ціни таксі економ, стандарт та преміум класу.
            Найправильнішим рішенням буде попереднє замовлення таксі в аеропорт в службі «Таксі Лайт Юа». Це дасть можливість заздалегідь розрахувати вартість та подбати про майбутню поїздку. Водій візьме ваше замовлення заздалегідь та складе свій маршрут так, щоб прибути без запізнень. Попереднє замовлення таксі в аеропорт позбавить вас від пошуку найближчого вільного автомобіля.
            Попереднє замовлення можна оформити за допомогою форми на нашому сайті, або залишити свій номер у формі обратного зв'язку на сайті. Оператор розрахує точну вартість та підбере найбільш підходящий автомобіль. Великий парк комфортабельних автомобілів для міжміських поїздок. Дізнайтесь на сайті.
            Кожен з нас заздалегідь прагне все спланувати, щоб не виникло неприємних сюрпризів, що потрібно зробити поїздку на між містами Києвскої області. Зі службою «Таксі Лайт Юа» ви можете не хвилюватися, ми пропонуємо якісний сервіс, швидку подачу та ціни таксі економ, стандарт та преміум класу. Також пропонуемо послуги мінібуса за найвигіднішими цінами для групових поїздок по області та по Києву.
            Найправильнішим рішенням буде попереднє замовлення таксі між містамі Києвскої області в службі «Таксі Лайт Юа». Це дасть можливість заздалегідь розрахувати вартість та подбати про майбутню поїздку. Водій візьме ваше замовлення заздалегідь та складе свій маршрут так, щоб прибути без запізнень. Попереднє замовлення таксі позбавить вас від пошуку найближчого вільного автомобіля.
            Попереднє замовлення можна оформити за допомогою форми на нашому сайті, або залишити свій номер у формі обратного зв'язку на сайті. Оператор розрахує точну вартість та підбере найбільш підходящий автомобіль. Необхідно організувати зустріч в аеропорту Бориспіль/Жуляни або на вокзалі Києва та області? В цьом разі вам неодмінно варто скористатися послугою Зустріч з табличкою від служби «Таксі Лайт Юа». Професійний водій оперативно прибуде та зустріне вас з табличкою біля виходу з паспортного контролю в аеропорту або біля виходу з вагона на вокзалі. Це зручно та безпечно, а зі службою «Таксі Лайт Юа», ще надійно та економно.
            Послуга зустрічі з табличкою в Києві та області дуже затребувані та популярні. В такому випадку краще перестрахуватися, завдяки цій послузі можна заздалегідь подбати про прибуття до Києва та організувати зустріч ще до виїзду.
            Послуги Зустріч з табличкою можна оформити за допомогою форми на нашому сайті, або залишити свій номер на сайті. Оператор розрахує точну вартість та надаст Вам допомогу."
        ];


        $quitesArr = Quite::all()->toArray(); //Заголовки

        $shortNews = "📢 " . mb_convert_case($keyWordsArr[rand(0, count($keyWordsArr) - 1)], MB_CASE_TITLE, "UTF-8") . ". "
            . $quitesArr[rand(0, count($quitesArr) - 1)]['name'];

        $newsArr = NewsList::all()->toArray(); //Старые новости

        $textArrNews = explode('.', $textArr[0]);

        $fullNews = "🚧 ";

        for ($i = 0; $i < 5; $i++) {
            $fullNewsArr[$i] = explode('.', $newsArr[rand(0, count($newsArr) - 1)]['full']);
            //Проверка вхождения ключевых слов
            $haystack = $fullNewsArr[$i][rand(0, count($fullNewsArr[$i]) - 1)];
            $keyWordsIns = 0;
            foreach ($keyWordsArr as $value) {
                if (strpos($haystack, $value)) {
                    $keyWordsIns++;
                    break;
                }
            }

            $haystackServ = $textArrNews [rand(0, count($textArrNews) - 1)];

            if (strpos($haystackServ, $fullNews) === false) {
                $haystackServ = $haystackServ  .  ". ";
            } else {
                $haystackServ = null;
            }

            if ($keyWordsIns === 0) {
                $randomText = $keyWordsArr[rand(0, count($keyWordsArr) - 1)] . ". ";
                $fullNews = $fullNews . $haystackServ . $fullNewsArr[$i][rand(0, count($fullNewsArr[$i]) - 1)] . $randomText;
            } else {
                $fullNews = $fullNews . $haystackServ . $fullNewsArr[$i][rand(0, count($fullNewsArr[$i]) - 1)] . ". ";
            }
        }

        $author = "🚖 Служба Таксі Лайт Юа";

        return [$shortNews, $fullNews, $author];
    }
}
